
      *EN ESTE ARCHIVO SE DEFINEN LOS CAMPOS QUE TENDRAN LOS ARCHIVOS Y SUS LONGITUDES.
       FD EMPLEADOS.
       01 EMPLEADOS-REGISTRO.
           05 EMPLEADOS-ID PIC 9(6).
           05 EMPLEADOS-NOMBRE PIC X(50).
           05 EMPLEADOS-APELLIDOS PIC X(50).
           05 EMPLEADOS-TELEFONO PIC X(50).
           05 EMPLEADOS-DIRECCION PIC X(50).
