      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
      *ESTE ARCHIVO TIENE EL PROPOSITO DE CREAR EL ARCHIVO QUE POSTERIORMENTE VAMOS A UTILIZAR PARA QUE NO DE ERROR SI USAMOS
      *OUTPUT,I-O, INPUT.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *CREO EL ARCHIVO EMPLEADOS-2.
       SELECT EMPLEADOS-2
       ASSIGN TO "EMPLEADOS.TXT"
       ORGANIZATION IS LINE SEQUENTIAL.

       COPY "copy-fisico.cbl".


       DATA DIVISION.

       FILE SECTION.
       COPY "COPY-LOGICO.CBL".
      *DEFINO LOS CAMPOS DEL ARCHIVO EMPLEADOS-2.
       FD EMPLEADOS-2.
           01 EMP-REG.
               05 EMP-ID PIC X(6).
               05 EMP-NOMBRE PIC X(50).
               05 EMP-APELLIDOS PIC X(50).
               05 EMP-TELEFONO PIC X(50).
               05 EMP-DIRECCION PIC X(50).
       WORKING-STORAGE SECTION.
      *DEFINO LA VARIABLE 'BANDERA' PARA DEFINIR CICLOS.
       77 BANDERA PIC X VALUE SPACES.
       PROCEDURE DIVISION.
       INICIO.
      *EMPIEZO ABRIENDO AMBOS ARCHIVOS.
           PERFORM APERTURA.
           MOVE "1" TO BANDERA.
           PERFORM LEER
      *REALIZO ESTE CICLO HASTA QUE 'BANDERA' ESTE BAJA (YA NO HAY MAS EMPLEADOS).
           UNTIL BANDERA = "0".
           FINALIZAR-PROGRAMA.
               PERFORM CIERRE.
               STOP RUN.





       LEER.
      *LEO EN FORMA SECUENCIAL CADA EMPLEADO DEL ARCHIVO 'EMPLEADOS-2',
      *CUANDO TERMINE LA BANDERA VALERÁ 0.
           READ EMPLEADOS-2 NEXT RECORD

           AT END

           MOVE "0" TO BANDERA

           NOT AT END
      *MIENTRAS NO TERMINE DE LEER, LOS VALORES QUE LEA DEL
      *ARCHIVO 'EMPLEADOS-2' LOS MOVERÉ AL ARCHIVO 'EMPLEADOS'.

           MOVE EMP-ID TO EMPLEADOS-ID
           MOVE EMP-NOMBRE TO EMPLEADOS-NOMBRE
           MOVE EMP-APELLIDOS TO EMPLEADOS-APELLIDOS
           MOVE EMP-TELEFONO TO EMPLEADOS-TELEFONO
           MOVE EMP-DIRECCION TO EMPLEADOS-DIRECCION
      *UNA VEZ REALIZADO LO ANTERIOR, ESCRIBO EL EMPLEADO EN EL ARCHIVO INDEXADO.
           WRITE EMPLEADOS-REGISTRO

           END-READ.







       APERTURA.
      *AL TENER YA EL ARCHIVO DE EMPLEADOS-2 LO HAGO CON INPUT.
           OPEN INPUT EMPLEADOS-2
      *EL DE EMPLEADOS NO EXISTE, CON LO CUAL LO ABRO Y CREO CON OUTPUT.
           OUTPUT EMPLEADOS.





       CIERRE.
      *CIERRO AMBOS ARCHIVOS.
           CLOSE EMPLEADOS
            EMPLEADOS-2
           STOP RUN.

       END PROGRAM YOUR-PROGRAM-NAME.
