      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           COPY "COPY-FISICO.CBL".
       DATA DIVISION.
       FILE SECTION.
       COPY "COPY-LOGICO.CBL".
       WORKING-STORAGE SECTION.
      *DEFINO 3 CAMPOS; 'BANDERA' FUNCIONARIA COMO UN AUXILIAR PARA
      *QUE EL PROGRAMA SEPA SI TIENE QUE SEGUI CON UN CICLO O NO.
       77 BANDERA PIC X.
      *'SI-NO' EN ESTA VARIABLE SE GUARDARIA LA CONFIRMACION O NO DE LA
      *ELIMINACION DEL EMPLEADO
       77 SI-NO PIC X(2) VALUE SPACES.
      *'ID-BUSCADO' EN ESTA VARIABLE SE ALMACENARA EL ID QUE SE DESEA ELIMINAR
       77 ID-BUSCADO PIC 9(6) VALUES ZERO.
       PROCEDURE DIVISION.
      *AQUI INICIA EL PROGRAMA.
          INICIO.
      *INICIAMOS ABRIENDO EL ARCHIVO DE EMPLEADOS.DAT.
              PERFORM OPEN-FILE.
      *HACEMOS UN SALTO A LA RUTA 'OBTENER-REGISTRO',
      *EN ESTA SE HARIA TODO EL PROCESO DE BUSCAR AL EMPLEADO.
              PERFORM OBTENER-REGISTRO
              PERFORM ELIMINAR-EMPLEADO
              UNTIL ID-BUSCADO = ZERO.

              FINALIZAR-PROGRAMA.
                  PERFORM CLOSE-FILE.

              OBTENER-REGISTRO.
                  PERFORM SETS.
                  PERFORM BUSQUEDA.
      *INICIAMOS CON LA BANDERA BAJA CON UNA 'N'.
                  MOVE "N" TO BANDERA.
                  PERFORM ENCONTRAR
      *ACA LO QUE HAGO ES DECIR QUE ESTO SE REALIZARA HASTA QUE LA BANDERA
      * ESTE ALTA (SE ENCONTRO EL ID) O EL ID-BUSCADO SEA 0 (NO SE INGRESO UN ID).
                  UNTIL ID-BUSCADO = ZERO OR BANDERA = "S".

           SETS.
      *EMPEZAMOS MOVIENDO UN ESPACIO A 'BANDERA', PARA INICIALIZARLA.
               MOVE SPACE TO BANDERA
      *MOVEMOS ZERO A 'EMPLEADOS-ID' PARA TAMBIEN INICIALIZARLA,
      *ADEMAS ESTO ES NECESARIO TAMBIEN EN CASO DE QUE EL USUARIO NO QUIERA
      *ELIMINAR OTRO EMPLEADO O SE QUIERA SALIR DEL PROGRAMA.
               MOVE ZERO TO EMPLEADOS-ID.


           BUSQUEDA.

      *EN ESTA RUTA LE PEDIMOS AL USUARIO EL ID DEL EMPLEADO A ELIMINAR
               DISPLAY "INGRESE EL ID DEL EMPLEADO QUE DESEA ELIMINAR"
               DISPLAY "INGRESE UN NUMERO DEL 1-500"
               DISPLAY "PRESIONE CUALQUIER OTRA TECLA PARA SALIR"
               ACCEPT ID-BUSCADO.
               MOVE ID-BUSCADO TO EMPLEADOS-ID.




           ENCONTRAR.
      *PRIMERO LO QUE HACEMOS ES ENCONTRAR EL ID BUSCADO EN EL ARCHIVO
               PERFORM LECTURA.
      *LUEGO EN CASO DE QUE LA BANDERA PERMANEZCA BAJA SE MOSTRARA UN MENSAJE
      *Y SE LE DARA NUEVAMENTE LA OPCION DE QUE INGRESE EL ID A ELIMINAR.
               IF BANDERA = "N"
                   DISPLAY "NO SE ENCONTRO NINGUN EMPLEADO CON ESE ID"
                   PERFORM BUSQUEDA.


           LECTURA.
      *AQUI LO PRIMERO QUE HACEMOS ES LEVANTAR LA BANDERA PENSANDO
      *QUE SE VA A ENCONTRAR ELÑ ID. LUEGO LEEMOS EL ARCHIVO EMPLEADOS
      *Y EN CASO DE QUE LA CLAVE QUE BUSCAMOS SEA INVALIDA,
      *SE BAJARA NUEVAMENTE LA BANDERA
               MOVE "S" TO BANDERA
               READ EMPLEADOS RECORD INVALID KEY
               MOVE "N" TO BANDERA.


           OPEN-FILE.
              OPEN I-O EMPLEADOS.




            CLOSE-FILE.
      *CERRAMOS EL ARCHIVO 'EMPLEADOS'
               CLOSE EMPLEADOS
               STOP RUN.


            ELIMINAR-EMPLEADO.
      *EMPEZAMOS MOSTRANDO LOS DATOS DEL EMPLEADO QUE SE ELIMINARÁ
                PERFORM MOSTRAR-DATOS.
                PERFORM PREGUNTA.
      *EN CASO DE QUE LA RESPUESTA SEA 'SI' PROCEDEMOS A LA RUTA DONDE
      *ELIMINAMOS AL EMPLEADOS DEL ARCHIVO.
                IF SI-NO = "SI"
                    PERFORM ELIMINAR.
                PERFORM OBTENER-REGISTRO.

               MOSTRAR-DATOS.
               DISPLAY EMPLEADOS-ID
                DISPLAY EMPLEADOS-NOMBRE
                DISPLAY EMPLEADOS-APELLIDOS.
                DISPLAY EMPLEADOS-TELEFONO.
                DISPLAY EMPLEADOS-DIRECCION.


               PREGUNTA.
      *AQUI LO QUE HACEMOS ES CONFIRMAR LA DECISION DEL USUARIO
                DISPLAY
                "CONFIRMA QUE DESEA ELIMINAR AL EMPLEADO? SI/NO"
                ACCEPT SI-NO.
      *VERIFICAMOS QUE LO QUE INGRESE SEA UNA RESPUESTA VÁLIDA.
                IF SI-NO = "SI"
                   MOVE "SI" TO SI-NO.

                IF SI-NO NOT= "SI" AND SI-NO NOT= "NO"
                    DISPLAY "DEBE INGRESAR SI O NO"
                    PERFORM ELIMINAR-EMPLEADO.



                ELIMINAR.
      *ELIMINAMOS AL EMPLEADO DEL ARCHIVO ´EMPLEADOS´, EN CASO DE QUE
      *HAYA ALGUN INCONVENIENTE, SE DESPLEGARÁ UN MENSAJE
                    DELETE EMPLEADOS RECORD
                    INVALID KEY
                    DISPLAY
                    "NO SE PUDO ELIMINAR EL EMPLEADO CORRECTAENTE".
       END PROGRAM YOUR-PROGRAM-NAME.
