      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *SE ELABORA UN COPY DEL ARCHIVO "COPY-FISICO.CBL" PARA NO TENER QUE REESCRIBIRLO AQUI
       COPY "copy-fisico.cbl".
       DATA DIVISION.
       FILE SECTION.
       COPY "copy-logico.cbl".
       WORKING-STORAGE SECTION.
      *ESTA VARIABLE COMPUESTA CUMPLE LA FUNCION DE SEPARADOR PARA QUE A
      *LA HORA DE MOSTRAR EL ARCHIVO SE PUEDAN DIFERENCIAR LOS CAMPOS,
      *PARA ESTO USO LA PALABRA RESERVADA 'FILLER'.
       01 WS-LINEA-SALIDA.
          08 WS-ID PIC Z(6).
          08 FILLER PIC X VALUE SPACE.
          08 WS-NOMBRE PIC X(50).
          08 FILLER PIC X(2) VALUE SPACE.
          08 WS-APELLIDO PIC X(50).
          08 FILLER PIC X(2) VALUE SPACE.
          08 WS-TEL PIC X(50).
          08 FILLER PIC X(2) VALUE SPACE.
          08 WS-DIR PIC X(50).
      *'BANDERA SERVIRÁ PARA SABER CUANDO DEBE CONTINUAR UN CICLO O NO'.
       77 BANDERA PIC X VALUE SPACES.
      *SERÁ LA VARIABLE QUE UTILIZARÉ COMO CONTADOR PARA SABER CUANDO
      *MOSTRAR UN CARTEL.
       77 MOSTRAR PIC 9(9) VALUES ZERO.
      *UNA VARIABLE PARA ALMACENAR UN ESPACIO.
       77 ENTER PIC X.
       PROCEDURE DIVISION.
           INICIO.
      *EMPIEZO ABRIENDO EL ARCHIVO.
               PERFORM OPEN-FILE.
      *INICIALIZO EL CONTADOR.
               MOVE ZERO TO MOSTRAR
      *INICIALIZO LA BANDERA.
               MOVE "1" TO BANDERA
               PERFORM REGISTRAR.
      *VERIFICAMOS SI EL ARCHIVO ESTA VACÍO.
               IF BANDERA = "0"
                  DISPLAY "NO SE ENCONTRARON REGISTROS EN LOS ARCHIVOS"

               ELSE
                   PERFORM CAMPOS
      *REALIZAMOS ESTE CICLO HASTA QUE LA BANDERA VALGA 0.
                   UNTIL BANDERA = "0".

                   FINALIZA-PROGRAMA.
                   PERFORM CIERRE-ARCHIVO.
                   STOP RUN.



           REGISTRAR.
      *LEO LOS EMPLEADOS DEL ARCHIVO 'EMPLEADOS' Y CUANDO TERMINE MUEVO A 0 LA BANDERA.
      *SE UTILIZA NEXT RECORD PARA UNA LECUTRA SECUENCIAL.
               READ EMPLEADOS NEXT RECORD
               AT END
               MOVE "0" TO BANDERA.


           CAMPOS.
      *MOSTRAMOS LOS DATOS DEL EMPLEADO Y LUEGO LEEMOS EL SIGUIENTE.
               PERFORM MOSTRAR-CAMPOS
               PERFORM REGISTRAR.


           OPEN-FILE.
               OPEN I-O EMPLEADOS.

           CIERRE-ARCHIVO.
      *CERRAMOS EL ARCHIVO EMPLEADOS
               CLOSE EMPLEADOS.


           MOSTRAR-CAMPOS.
      *MOSTRAMOS LOS DATOS Y CADA 50 EMPLEADOS PREGUNTAMOS SI QUIERE SEGUIR VIENDO.
               IF MOSTRAR = 50
               PERFORM PREGUNTA.
      *MOVEMOS LOS VALORES A LAS SUB-VARIABLES DE LA VARIABLE COMPUESTA
      *PARA DESPUES PODER MOSTRARLAS DE FORMA ORDENADA.
               MOVE EMPLEADOS-ID        TO WS-ID
               MOVE EMPLEADOS-NOMBRE    TO WS-NOMBRE
               MOVE EMPLEADOS-APELLIDOS TO WS-APELLIDO
               MOVE EMPLEADOS-TELEFONO  TO WS-TEL
               MOVE EMPLEADOS-DIRECCION TO WS-DIR

               DISPLAY WS-LINEA-SALIDA
               ADD 1 TO MOSTRAR.

           PREGUNTA.
      *SE REALIZA LA PREGUNTA Y SE REINICIA EL CONTADOR 'MOSTRAR'
      *TAMBIEN SE DA LA OPCION DE SALIRSE DEL PROGRAMA.
               DISPLAY
               "PRESIONE ENTER PARA VER LOS SIGUIENTES 50 EMPLEADOS".
               DISPLAY
           "EN CASO DE NO QUERER SEGUIR VIENDO REGISTROS,PRESIONAR N".
               ACCEPT ENTER.
               IF ENTER = "N"
                   GO TO FINALIZA-PROGRAMA.
               MOVE ZERO TO MOSTRAR.
      *FINALIZA PROGRAMA
           END PROGRAM YOUR-PROGRAM-NAME.
